# Clohing_store - Beginner_project

This script connects to **MySQL Workbench**. Thanks to this, using the **Python** programming language it is possible to query SQL queries. This is a supplement to the SQL file written in the MySQL Workbench environment contained in this repository. The script presents a database of an imaginary **Clothing store** and a short data analysis using basic SQL queries.

In [1]:
# Importing MySQL Connector
import mysql.connector

#### 1. Create a "Clothing Store" Database

In [2]:
# Creating a connection to the MySQL Workbench
mydb = mysql.connector.connect(
  host="***",
  user="***",
  password="***"
)

mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE clothing_store")

#### 2. Create a "Supplier" table with the following columns:
* Supplier_Id
* Supplier_Name
* Supplier_Address
* Supplier_NIP
* Contract_Signing_Date_With_Producer

-- Set the appropriate "constraint" for each column

In [3]:
# Creating a connection to the database
mydb = mysql.connector.connect(
  host="***",
  user="***",
  password="***",
  database="clothing_store"
)

mycursor = mydb.cursor()

mycursor.execute(
"""CREATE TABLE Supplier(
Supplier_Id INT PRIMARY KEY,
Supplier_Name VARCHAR(20) UNIQUE,
Supplier_Address VARCHAR(30),
Supplier_NIP BIGINT,
Contract_Signing_Date_With_Producer DATE
)""")

#### 3. Create a "Product" table with the following columns:
* Product_Id
* Supplier_Name
* Product_Name
* Product_Description
* Net_Purchase_Price
* Gross_Purchase_Price
* Net_Selling_Price
* Gross_Seling_Price
* Sales_VAT_Percentage

-- Set the appropriate "constraint" for each column

In [4]:
mycursor.execute(
"""CREATE TABLE Product(
Product_Id INT PRIMARY KEY,
Supplier_Name VARCHAR(20) NOT NULL,
Product_Name VARCHAR(20) NOT NULL,
Product_Description VARCHAR(10),
Net_Purchase_Price FLOAT NOT NULL,
Gross_Purchase_Price FLOAT NOT NULL,
Net_Selling_Price FLOAT NOT NULL,
Gross_Selling_Price FLOAT NOT NULL,
Sales_VAT_Percentage FLOAT NOT NULL
)""")

#### 4. Create a "Orders" table with the following columns:
* Order_Id,
* Customer_Id,
* Product_Id,
* Order_Date

-- Set the appropriate "constraint" for each column

In [5]:
mycursor.execute(
"""CREATE TABLE Orders(
Order_Id INT PRIMARY KEY,
Customer_Id INT,
Product_Id INT,
Order_Date DATE
)""")

#### 5. Create a "Customer" table with the following columns:
* Customer_Id
* Order_Id
* First_Name
* Last_Name
* Address

-- Set the appropriate "constraint" for each column

In [6]:
mycursor.execute(
"""CREATE TABLE Customer(
Customer_Id INT PRIMARY KEY,
Order_Id INT,
First_Name VARCHAR(20) NOT NULL,
Last_Name VARCHAR(20) NOT NULL,
Address VARCHAR(30)
)""")

In [7]:
# Displaying all created tables
mycursor.execute ("SHOW TABLES")

for x in mycursor:
    print(x)

('customer',)
('orders',)
('product',)
('supplier',)

#### 6. Complete each table with data according to:
* "Supplier" table - 4 items
* "Product" table - 20 items
* "Orders" table - 10 items
* "Customer" table - 10 items

In [8]:
sql_supplier = """INSERT INTO Supplier (
Supplier_Id, 
Supplier_Name, 
Supplier_Address, 
Supplier_NIP, 
Contract_Signing_Date_With_Producer
) 
VALUES (%s, %s, %s, %s, %s)"""

val_supplier = [
(1, 'BeFirst', 'Zielona 35, Gdansk', 1234567890, '2012-05-16'),
(2, 'Adios', 'Niebieska 17, Krakow', 3987654321, '2010-03-11'),
(3, '4win', 'Czarna 33, Wroclaw', 1357908642, '2009-10-30'),
(4, 'OneTwo', 'Czerwona 14, Katowice', 2468097531, '2013-12-01'
)]

mycursor.executemany(sql_supplier, val_supplier)
mydb.commit()

print(mycursor.rowcount, "was inserted")

4 was inserted

In [9]:
mycursor.execute("SELECT * FROM Supplier")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1, 'BeFirst', 'Zielona 35, Gdansk', 1234567890, datetime.date(2012, 5, 16))
(2, 'Adios', 'Niebieska 17, Krakow', 3987654321, datetime.date(2010, 3, 11))
(3, '4win', 'Czarna 33, Wroclaw', 1357908642, datetime.date(2009, 10, 30))
(4, 'OneTwo', 'Czerwona 14, Katowice', 2468097531, datetime.date(2013, 12, 1))

In [10]:
sql_product = """INSERT INTO Product (
Product_Id,
Supplier_Name,
Product_Name,
Product_Description,
Net_Purchase_Price,
Gross_Purchase_Price,
Net_Selling_Price,
Gross_Selling_Price,
Sales_VAT_Percentage
) 
VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)"""

val_product = [
(1001, 'BeFirst', 'shoes', 'green', 200, 246, 350, 410, 0.17),
(1002, 'Adios', 'shoes', 'black', 150, 188, 310, 380, 0.23),
(1003, 'OneTwo', 't-shirt', 'green', 70, 97, 120, 145, 0.21),
(1004, '4win', 'cap', 'pink', 50, 65, 100, 125, 0.25),
(1005, 'Adios', 'tracksuits', 'black', 125, 170, 190, 233, 0.23),
(1006, 'BeFirst', 'cap', 'grey', 92, 114, 135, 171, 0.27),
(1007, 'BeFirst', 't-shirt', 'red', 133, 199, 235, 280, 0.19),
(1008, 'OneTwo', 'shoes', 'white', 300, 350, 400, 460, 0.15),
(1009, 'Adios', 'cap', 'green', 55, 69, 99, 140, 0.41),
(1010, '4win', 'shoes', 'grey', 180, 231, 285, 322, 0.13),
(1011, '4win', 'tracksuits', 'blue', 100, 130, 177, 200, 0.13),
(1012, 'OneTwo', 'cap', 'yellow', 38, 63, 85, 97, 0.14),
(1013, 'OneTwo', 'tracksuits', 'orange', 78, 111, 141, 177, 0.26),
(1014, 'BeFirst', 'jacket', 'black', 220, 270, 340, 399, 0.17), 
(1015, 'Adios', 't-shirt', 'green', 99, 129, 159, 199, 0.25),
(1016, 'OneTwo', 'jacket', 'white', 100, 133, 180, 211, 0.17),
(1017, 'Adios', 'jacket', 'blue', 210, 267, 300, 346, 0.15),
(1018, '4win', 't-shirt', 'yellow', 95, 115, 150, 195, 0.30),
(1019, 'BeFirst', 'tracksuits', 'purple', 140, 172, 218, 279, 0.28),
(1020, '4win', 'jacket', 'white', 370, 417, 510, 599, 0.17
)]

mycursor.executemany(sql_product, val_product)
mydb.commit()

print(mycursor.rowcount, "was inserted")

20 was inserted

In [11]:
mycursor.execute("SELECT * FROM Product")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1001, 'BeFirst', 'shoes', 'green', 200.0, 246.0, 350.0, 410.0, 0.17)
(1002, 'Adios', 'shoes', 'black', 150.0, 188.0, 310.0, 380.0, 0.23)
(1003, 'OneTwo', 't-shirt', 'green', 70.0, 97.0, 120.0, 145.0, 0.21)
(1004, '4win', 'cap', 'pink', 50.0, 65.0, 100.0, 125.0, 0.25)
(1005, 'Adios', 'tracksuits', 'black', 125.0, 170.0, 190.0, 233.0, 0.23)
(1006, 'BeFirst', 'cap', 'grey', 92.0, 114.0, 135.0, 171.0, 0.27)
(1007, 'BeFirst', 't-shirt', 'red', 133.0, 199.0, 235.0, 280.0, 0.19)
(1008, 'OneTwo', 'shoes', 'white', 300.0, 350.0, 400.0, 460.0, 0.15)
(1009, 'Adios', 'cap', 'green', 55.0, 69.0, 99.0, 140.0, 0.41)
(1010, '4win', 'shoes', 'grey', 180.0, 231.0, 285.0, 322.0, 0.13)
(1011, '4win', 'tracksuits', 'blue', 100.0, 130.0, 177.0, 200.0, 0.13)
(1012, 'OneTwo', 'cap', 'yellow', 38.0, 63.0, 85.0, 97.0, 0.14)
(1013, 'OneTwo', 'tracksuits', 'orange', 78.0, 111.0, 141.0, 177.0, 0.26)
(1014, 'BeFirst', 'jacket', 'black', 220.0, 270.0, 340.0, 399.0, 0.17)
(1015, 'Adios', 't-shirt', 'green', 99.0, 129.0, 159.0, 199.0, 0.25)
(1016, 'OneTwo', 'jacket', 'white', 100.0, 133.0, 180.0, 211.0, 0.17)
(1017, 'Adios', 'jacket', 'blue', 210.0, 267.0, 300.0, 346.0, 0.15)
(1018, '4win', 't-shirt', 'yellow', 95.0, 115.0, 150.0, 195.0, 0.3)
(1019, 'BeFirst', 'tracksuits', 'purple', 140.0, 172.0, 218.0, 279.0, 0.28)
(1020, '4win', 'jacket', 'white', 370.0, 417.0, 510.0, 599.0, 0.17)

In [12]:
sql_orders = """INSERT INTO Orders (
Order_Id,
Customer_Id,
Product_Id,
Order_Date
)
VALUES (%s, %s, %s, %s)"""

val_orders = [
(1, 101, 1020, '2018-12-08'),
(2, 102, 1015, '2017-10-03'),
(3, 103, 1001, '2015-07-13'),
(4, 104, 1019, '2021-05-08'),
(5, 105, 1003, '2021-05-08'),
(6, 106, 1015, '2019-04-22'),
(7, 107, 1010, '2016-05-29'),
(8, 108, 1015, '2021-01-19'),
(9, 109, 1008, '2020-09-04'),
(10, 110, 1017, '2019-02-23'
)]

mycursor.executemany(sql_orders, val_orders)
mydb.commit()

print(mycursor.rowcount, "was inserted")

10 was inserted

In [13]:
mycursor.execute("SELECT * FROM Orders")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1, 101, 1020, datetime.date(2018, 12, 8))
(2, 102, 1015, datetime.date(2017, 10, 3))
(3, 103, 1001, datetime.date(2015, 7, 13))
(4, 104, 1019, datetime.date(2021, 5, 8))
(5, 105, 1003, datetime.date(2021, 5, 8))
(6, 106, 1015, datetime.date(2019, 4, 22))
(7, 107, 1010, datetime.date(2016, 5, 29))
(8, 108, 1015, datetime.date(2021, 1, 19))
(9, 109, 1008, datetime.date(2020, 9, 4))
(10, 110, 1017, datetime.date(2019, 2, 23))

In [14]:
sql_customer = """INSERT INTO Customer (
Customer_Id,
Order_Id,
First_Name,
Last_Name,
Address
)
VALUES (%s, %s, %s, %s, %s)"""

val_customer = [
(101, 1, 'Jan', 'Kowalski', 'Rumiankowa 13, Warszawa'),
(102, 2, 'Piotr', 'Nowak', 'Jesionowa 4, Wroclaw'),
(103, 3, 'Anna', 'Kwiatkowska', 'Kasztanowa 14, Gdansk'),
(104, 4, 'Katarzyna', 'Wozniak', 'Bukowa 78, Krakow'),
(105, 5, 'Kazimierz', 'Marciniak', 'Lipowa 13, Katowice'),
(106, 6, 'Bozena', 'Grabowska', 'Akacjowa 21, Lublin'),
(107, 7, 'Michal', 'Michalski', 'Truskawkowa 28, Torun'),
(108, 8, 'Martyna', 'Bruska', 'Topolowa 11, Poznan'),
(109, 9, 'Andrzej', 'Wolski', 'Jasminowa 99, Bialystok'),
(110, 10, 'Maria', 'Bimber', 'Brzoskwiniowa 44, Szczecin'
)]

mycursor.executemany(sql_customer, val_customer)
mydb.commit()

print(mycursor.rowcount, "was inserted")

10 was inserted

In [15]:
mycursor.execute("SELECT * FROM Customer")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(101, 1, 'Jan', 'Kowalski', 'Rumiankowa 13, Warszawa')
(102, 2, 'Piotr', 'Nowak', 'Jesionowa 4, Wroclaw')
(103, 3, 'Anna', 'Kwiatkowska', 'Kasztanowa 14, Gdansk')
(104, 4, 'Katarzyna', 'Wozniak', 'Bukowa 78, Krakow')
(105, 5, 'Kazimierz', 'Marciniak', 'Lipowa 13, Katowice')
(106, 6, 'Bozena', 'Grabowska', 'Akacjowa 21, Lublin')
(107, 7, 'Michal', 'Michalski', 'Truskawkowa 28, Torun')
(108, 8, 'Martyna', 'Bruska', 'Topolowa 11, Poznan')
(109, 9, 'Andrzej', 'Wolski', 'Jasminowa 99, Bialystok')
(110, 10, 'Maria', 'Bimber', 'Brzoskwiniowa 44, Szczecin')

#### 7. Link the columns together so that the tables communicate with each other
* Product - Supplier
* Product - Orders
* Orders - Customer

In [16]:
sql_link1 = """ALTER TABLE Product
ADD FOREIGN KEY (Supplier_Name) 
REFERENCES Supplier(Supplier_Name)"""

mycursor.execute(sql_link1)

mydb.commit()

In [17]:
sql_link2 = """ALTER TABLE Orders
ADD FOREIGN KEY (Product_Id)
REFERENCES Product(Product_Id)"""

mycursor.execute(sql_link2)

mydb.commit()

In [18]:
sql_link3 = """ALTER TABLE Orders
ADD FOREIGN KEY (Customer_Id)
REFERENCES Customer(Customer_ID)"""

mycursor.execute(sql_link3)

mydb.commit()

In [19]:
sql_link4 = """ALTER TABLE Customer
ADD FOREIGN KEY (Order_Id)
REFERENCES Orders(Order_Id)"""

mycursor.execute(sql_link4)

mydb.commit()

#### 8. Display all products with all data from the supplier that is in position 1 in the "Supplier" table

In [20]:
mycursor.execute(
"""SELECT Product_Name, Product.Supplier_Name, Supplier_Id, 
Supplier_Address, Supplier_NIP, Contract_Signing_Date_With_Producer
FROM Product, Supplier
WHERE Product.Supplier_Name = Supplier.Supplier_Name
AND Supplier_Id = 1"""
)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('shoes', 'BeFirst', 1, 'Zielona 35, Gdansk', 1234567890, datetime.date(2012, 5, 16))
('cap', 'BeFirst', 1, 'Zielona 35, Gdansk', 1234567890, datetime.date(2012, 5, 16))
('t-shirt', 'BeFirst', 1, 'Zielona 35, Gdansk', 1234567890, datetime.date(2012, 5, 16))
('jacket', 'BeFirst', 1, 'Zielona 35, Gdansk', 1234567890, datetime.date(2012, 5, 16))
('tracksuits', 'BeFirst', 1, 'Zielona 35, Gdansk', 1234567890, datetime.date(2012, 5, 16))

#### 9. Sort these products by Name from A-B

In [21]:
mycursor.execute(
"""SELECT Product_Name, Product.Supplier_Name, Supplier_Id, 
Supplier_Address, Supplier_NIP, Contract_Signing_Date_With_Producer
FROM Product, Supplier
WHERE Product.Supplier_Name = Supplier.Supplier_Name
AND Supplier_Id = 1
ORDER BY Product_Name ASC"""
)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('cap', 'BeFirst', 1, 'Zielona 35, Gdansk', 1234567890, datetime.date(2012, 5, 16))
('jacket', 'BeFirst', 1, 'Zielona 35, Gdansk', 1234567890, datetime.date(2012, 5, 16))
('shoes', 'BeFirst', 1, 'Zielona 35, Gdansk', 1234567890, datetime.date(2012, 5, 16))
('t-shirt', 'BeFirst', 1, 'Zielona 35, Gdansk', 1234567890, datetime.date(2012, 5, 16))
('tracksuits', 'BeFirst', 1, 'Zielona 35, Gdansk', 1234567890, datetime.date(2012, 5, 16))

#### 10. Calculate the average price for a product from this supplier

In [22]:
mycursor.execute(
"""SELECT ROUND(AVG(Net_Selling_Price), 0) AS Average_Price, Supplier_Id
FROM Product, Supplier
WHERE Supplier_Id = 1"""
)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(224.0, 1)

#### 11. Display two product groups of this supplier:
* Half of the cheapest are group: "Cheap"
* Others are group: "Expensive"

In [23]:
mycursor.execute(
"""SELECT Product_Name, Net_Selling_Price,
CASE
    WHEN NTILE (2) OVER (ORDER BY Net_Selling_Price) = 1 THEN 'Cheap' 
    WHEN NTILE (2) OVER (ORDER BY Net_Selling_Price) = 2 THEN 'Expensive'
END
FROM Product, Supplier
WHERE Supplier_Id = 1"""
)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('cap', 85.0, 'Cheap')
('cap', 99.0, 'Cheap')
('cap', 100.0, 'Cheap')
('t-shirt', 120.0, 'Cheap')
('cap', 135.0, 'Cheap')
('tracksuits', 141.0, 'Cheap')
('t-shirt', 150.0, 'Cheap')
('t-shirt', 159.0, 'Cheap')
('tracksuits', 177.0, 'Cheap')
('jacket', 180.0, 'Cheap')
('tracksuits', 190.0, 'Expensive')
('tracksuits', 218.0, 'Expensive')
('t-shirt', 235.0, 'Expensive')
('shoes', 285.0, 'Expensive')
('jacket', 300.0, 'Expensive')
('shoes', 310.0, 'Expensive')
('jacket', 340.0, 'Expensive')
('shoes', 350.0, 'Expensive')
('shoes', 400.0, 'Expensive')
('jacket', 510.0, 'Expensive')

#### 12. Display ordered products by displaying the name

In [24]:
mycursor.execute(
"""SELECT Orders.Order_Id, Product.Product_Name
FROM Orders
JOIN Product 
ON Orders.Product_Id = Product.Product_Id"""
)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(3, 'shoes')
(5, 't-shirt')
(9, 'shoes')
(7, 'shoes')
(2, 't-shirt')
(6, 't-shirt')
(8, 't-shirt')
(10, 'jacket')
(4, 'tracksuits')
(1, 'jacket')

#### 13. Display all products ordered - limited to the displayed 5 items

In [25]:
mycursor.execute(
"""SELECT Orders.Order_Id, Product.Product_Name
FROM Orders
JOIN Product 
ON Orders.Product_Id = Product.Product_Id
LIMIT 5"""
)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(3, 'shoes')
(5, 't-shirt')
(9, 'shoes')
(7, 'shoes')
(2, 't-shirt')

#### 14. Calculate the value of all orders

In [26]:
mycursor.execute(
"""SELECT SUM(Gross_Selling_Price) AS Total_Order_Value
FROM Product
INNER JOIN Orders
ON Product.Product_Id = Orders.Product_Id"""
)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(3158.0,)

#### 15. Display all orders and products sorted by date from oldest to newest

In [27]:
mycursor.execute(
"""SELECT Orders.Order_Date, Orders.Order_Id, Product.Product_Name
FROM Orders, Product
WHERE Orders.Product_Id = Product.Product_Id
ORDER BY Orders.Order_Date"""
)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(datetime.date(2015, 7, 13), 3, 'shoes')
(datetime.date(2016, 5, 29), 7, 'shoes')
(datetime.date(2017, 10, 3), 2, 't-shirt')
(datetime.date(2018, 12, 8), 1, 'jacket')
(datetime.date(2019, 2, 23), 10, 'jacket')
(datetime.date(2019, 4, 22), 6, 't-shirt')
(datetime.date(2020, 9, 4), 9, 'shoes')
(datetime.date(2021, 1, 19), 8, 't-shirt')
(datetime.date(2021, 5, 8), 4, 'tracksuits')
(datetime.date(2021, 5, 8), 5, 't-shirt')

#### 16. Check if you have completed all data in the products table - display items for which data is missing

In [28]:
mycursor.execute(
"""SELECT * FROM Product
WHERE Product_Name IS NULL
OR Supplier_Name IS NULL 
OR Product_Name IS NULL
OR Product_Description IS NULL 
OR Net_Purchase_Price IS NULL 
OR Gross_Purchase_Price IS NULL
OR Net_Selling_Price IS NULL 
OR Gross_Selling_Price IS NULL 
OR Sales_VAT_Percentage IS NULL"""
)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

There is no missing data in the Product table.

#### 17. Display the most sold products along with their price

In [29]:
mycursor.execute(
"""SELECT Product_Name, COUNT(Product_Name) AS Best, Net_Selling_Price
FROM Product
INNER JOIN Orders
ON Product.Product_Id = Orders.Product_Id
GROUP BY Product_Name, Net_Selling_Price
ORDER BY Best DESC"""
)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('t-shirt', 3, 159.0)
('shoes', 1, 350.0)
('t-shirt', 1, 120.0)
('shoes', 1, 400.0)
('shoes', 1, 285.0)
('jacket', 1, 300.0)
('tracksuits', 1, 218.0)
('jacket', 1, 510.0)

#### 18. Find the day with the most orders placed

In [30]:
mycursor.execute("""SELECT DISTINCT Order_Date, COUNT(Order_Date) AS Dates
FROM Orders
GROUP BY Order_Date
ORDER BY Dates DESC
LIMIT 1""")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(datetime.date(2021, 5, 8), 2)